<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"local","backend":"3fc88c11d00121c70876cd712697b43c6b2b3ccbfe81a1c0b6ee43a50324b9d6","plan_job_ref":"Job CI #12 at https://github.com/jacobscunn07/terraform-workflows-poc/actions/runs/5594438266","plan_hash":"27e814d0c4d20e7bb44f33f85fab1b319fee2c6ecf418a56673435e7d814afb6","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __.__ in the __staging__ workspace
With var files: `staging.tfvars
`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "staging Hola!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo.bar"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Release #34](https://github.com/jacobscunn07/terraform-workflows-poc/actions/runs/5594445325)